In [16]:
import pandas as pd
from sqlalchemy import create_engine

In [17]:
zillow_2016_df=pd.read_csv('/Users/maheshdivakarannair/Documents/GitHub/ETL_Project_HousingData/CleanData/Zillow_2016avghomeval.csv')

In [18]:
zillow_2016_df.head()

,zipcode,city,state,metro,countyname,2016_avghomevalue
0,10065,New York,NY,New York-Newark-Jersey City,New York County,8959594
1,10075,New York,NY,New York-Newark-Jersey City,New York County,8299805
2,10021,New York,NY,New York-Newark-Jersey City,New York County,7677481
3,10014,New York,NY,New York-Newark-Jersey City,New York County,6369047
4,10128,New York,NY,New York-Newark-Jersey City,New York County,6354494

In [21]:
rds_connection_string = "mahesh1:mahesh@localhost:5432/housing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [22]:
zillow_2016_df.to_sql(name='zillow_db', con=engine, if_exists='append', index=False)

In [23]:
pd.read_sql_query('select count(*) from zillow_db', con=engine).head()

   count
0  23307

In [24]:
zillow_2018_df=pd.read_csv('/Users/maheshdivakarannair/Documents/GitHub/ETL_Project_HousingData/CleanData/Zillow_2018avghomeval.csv')

In [25]:
zillow_2018_df.head()

,zipcode,city,state,metro,countyname,2018_avghomevalue
0,10065,New York,NY,New York-Newark-Jersey City,New York County,8779974
1,10075,New York,NY,New York-Newark-Jersey City,New York County,7859110
2,10021,New York,NY,New York-Newark-Jersey City,New York County,7397214
3,10128,New York,NY,New York-Newark-Jersey City,New York County,5937647
4,10014,New York,NY,New York-Newark-Jersey City,New York County,5687485

In [26]:
zillow_2018_df.to_sql(name='zillow_2018_db', con=engine, if_exists='append', index=False)

In [27]:
pd.read_sql_query('select count(*) from zillow_2018_db', con=engine).head()

   count
0  23307